FROM python:3.11-slim

# 1. Устанавливаем рабочую директорию
WORKDIR /project

# 2. Устанавливаем системные зависимости (один слой)
# Мы объединяем команды, чтобы уменьшить размер образа
RUN apt-get update && apt-get install -y \
    gcc \
    libpq-dev \
    && rm -rf /var/lib/apt/lists/*

# 3. Сначала копируем ТОЛЬКО файл зависимостей
# Это самая важная часть для скорости: если требования не менялись, 
# Docker пропустит установку библиотек при следующем билде
COPY requirements.txt .

# 4. Устанавливаем библиотеки с большим таймаутом
# Используем зеркало (по желанию), если основной сервер тормозит
RUN pip install --upgrade pip && \
    pip install --no-cache-dir --default-timeout=1000 -r requirements.txt

# 5. Только теперь копируем остальной код проекта
# Теперь изменения в коде не будут вызывать переустановку библиотек
COPY . .

# 6. Настройка путей
ENV PYTHONPATH=/project/app
# Создаем папку для логов, если её нет
RUN mkdir -p /project/logs

# 7. Запуск
CMD ["python", "app/bot.py"]